tutorials/H2_O2_N2_splitter/constant/speciesMu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      speciesMu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// log-polynomial viscosity coefficients: mu = 0.1*exp(Mu1 + ln(T)*Mu2 + ln(T)^2*Mu3 + ln(T)^3*Mu4)
// Mu1-4 are the first 4 values of muLogCoeffs<8> from thermo.foam

H2
{
    Mu1     -15.61577712441261;
    Mu2       0.7630864137641021;
    Mu3      -0.013999183594004275;
    Mu4       0.0005366603078286574;
}

O2
{
    Mu1     -18.672289150767078;
    Mu2       2.2974792436936537;
    Mu3      -0.21218322378202903;
    Mu4       0.00904821973598157;
}

N2
{
    Mu1     -18.153624429331092;
    Mu2       2.041471354469998;
    Mu3      -0.1792850212226811;
    Mu4       0.007640846835270048;
}

// ************************************************************************* //
