tutorials/H2_O2_N2_splitter/constant/trandat
! Species transport data (CHEMKIN format): geom eps/kb[K] sigma[A] dipole[Debye] alpha[A^3] Zrot
H2                 1   38.000   2.920   0.000   0.790   280.000
O2                 1  107.400   3.458   0.000   1.600     3.800
N2                 1   97.530   3.621   0.000   1.760     4.000
