tutorials/H2_O2_N2_splitter/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libdynamicMesh2D.so"
    "libdynamicFvMesh2D.so"
    "libchemistryModel_DLB.so"
);

application     detonationFoam_V2.0;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         3.32e-4;     // 5 air-stream flow-through times (L/U_air = 0.015/226)
//endTime         5e-7;     // 5 air-stream flow-through times (L/U_air = 0.015/226)

deltaT          1e-9;        // initial dt; CFL-adjusted each step

writeControl    adjustableRunTime;
writeInterval   6.64e-5;     // write every flow-through time
//writeInterval   0.5e-07;     // write every flow-through time

purgeWrite      0;

writeFormat     ascii;
writePrecision  12;
writeCompression off;

timeFormat      general;
timePrecision   12;

runTimeModifiable true;

adjustTimeStep  yes;
useAcousticCourant yes;

maxCo           0.1;
maxDeltaT       1e-8;
maxAcousticCo   0.3;

// ************************************************************************* //
