tutorials/H2_O2_N2_splitter/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM                                      |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    refineCells;
        type    cellSet;
        action  new;
        source  boxToCell;

        sourceInfo
        {
            box (-1e20 0.002 -1e20) (1e20 0.003 1e20);
        }
    }
);
